{
    "J1": {
        "kind": "point",
        "anchor": "mouth",
        "help": "Click the tip of the upper jaw."
    },
    "J2": {
        "kind": "point",
        "anchor": "mouth",
        "help": "Click the intersection of the upper and lower jaw. (This is not simply where the skin meets!)"
    },
    "J3": {
        "kind": "point",
        "anchor": "mouth",
        "help": "Click the tip of the lower jaw."
    },
    "E1": {
        "kind": "point",
        "anchor": "eye",
        "help": "Click the most anterior (forward) margin of the eye at its widest diameter."
    },
    "E2": {
        "kind": "point",
        "anchor": "eye",
        "help": "Click the most posterior (rearward) margin of the eye at its widest diameter."
    },
    "O1": {
        "kind": "point",
        "anchor": "operculum",
        "help": "Click the top point of the preopercule. This may not be visible in certain fishes, if it is not, place the point at the top-left corner of the image and make a comment below."
    },
    "O2": {
        "kind": "point",
        "anchor": "operculum",
        "help": "Click the posterior (rearward) \"elbow\" of the preopercule. This may not be visible in certain fishes, if it is not, place the point at the top-left corner of the image and make a comment below."
    },
    "O3": {
        "kind": "point",
        "anchor": "operculum",
        "help": "Click the bottom point of the preopercule. This may not be visible in certain fishes, if it is not, place the point at the top-left corner of the image and make a comment below."
    },
    "O4": {
        "kind": "point",
        "anchor": "operculum",
        "help": "Click the top point of the operculum (gill cover)."
    },
    "O5": {
        "kind": "point",
        "anchor": "operculum",
        "help": "Click the posterior (rearward) point of the operculum (gill cover)."
    },
    "P1": {
        "kind": "point",
        "anchor": "pectoral-fin",
        "help": "Click the base of the pectoral fin's top fin ray."
    },
    "P2": {
        "kind": "point",
        "anchor": "pectoral-fin",
        "help": "Click the distal tip of the pectoral fin's top fin ray."
    },
    "P3": {
        "kind": "point",
        "anchor": "pectoral-fin",
        "help": "Click the distal tip of the pectoral fin's bottom fin ray."
    },
    "P4": {
        "kind": "point",
        "anchor": "pectoral-fin",
        "help": "Click the base of the pectoral fin's bottom fin ray."
    },
    "D1": {
        "kind": "point",
        "anchor": "dorsal-fin",
        "help": "Click the base of the dorsal fin's anterior (forward) fin ray."
    },
    "D2": {
        "kind": "point",
        "anchor": "dorsal-fin",
        "help": "Click the distal tip of the dorsal fin's anterior (forward) fin ray."
    },
    "D3": {
        "kind": "point",
        "anchor": "dorsal-fin",
        "help": "Click the distal tip of the dorsal fin's posterior (rearward) fin ray."
    },
    "D4": {
        "kind": "point",
        "anchor": "dorsal-fin",
        "help": "Click the base of the dorsal fin's posterior (rearward) fin ray."
    },
    "C1": {
        "kind": "point",
        "anchor": "caudal-fin",
        "help": "Click the base of the caudal fin's top fin ray."
    },
    "C2": {
        "kind": "point",
        "anchor": "caudal-fin",
        "help": "Click the distal tip of the caudal fin's top fin ray."
    },
    "C3": {
        "kind": "point",
        "anchor": "caudal-fin",
        "help": "Click the distal tip of the caudal fin's bottom fin ray."
    },
    "C4": {
        "kind": "point",
        "anchor": "caudal-fin",
        "help": "Bottom intersection of the tail fin rays with the body."
    },
    "C5": {
        "kind": "point",
        "anchor": "caudal-fin",
        "help": "Click the midpoint of the base of the tail (between C1 and C3)."
    },
    "A1": {
        "kind": "point",
        "anchor": "anal-fin",
        "help": "Click the base of the anal fin's anterior (forward) fin ray."
    },
    "A2": {
        "kind": "point",
        "anchor": "anal-fin",
        "help": "Click the distal tip of the anal fin's anterior (forward) fin ray."
    },
    "A3": {
        "kind": "point",
        "anchor": "anal-fin",
        "help": "Click the distal tip of the anal fin's posterior (rearward) fin ray."
    },
    "A4": {
        "kind": "point",
        "anchor": "anal-fin",
        "help": "Click the base of the anal fin's posterior (rearward) fin ray."
    },
    "S1": {
        "kind": "curve",
        "anchor": "body-curves",
        "help": "Click and drag over the top curve of the body, from J1 to C2, excluding the dorsal fins."
    },
    "S2": {
        "kind": "curve",
        "anchor": "body-curves",
        "help": "Click and drag over the bottom curve of the body, from J3 to C3, excluding the ventral and anal fins."
    },
    "V1": {
        "kind": "line",
        "anchor": "measurements",
        "help": "Click and drag the longest straight line that can be drawn through the fish from top to the bottom, excluding fins."
    }
}
